[
{"title":"Pulp Fiction",
    "content":"There's this passage I got memorized. Ezekiel 25:17. 'The path of the righteous man is beset on all sides by the inequities of the selfish and the tyranny of evil men. Blessed is he who, in the name of charity and good will, shepherds the weak through the valley of darkness, for he is truly his brother's keeper and the finder of lost children. And I will strike down upon thee with great vengeance and furious anger those who attempt to poison and destroy my brothers. And you will know my name is The Lord when I lay my vengeance upon thee.' I been saying that shit for years. And if you heard it, that meant your ass. I never gave much thought to what it meant. I just thought it was some cold-blooded shit to say to a motherfucker before I popped a cap in his ass. But I saw some shit this morning made me think twice. See, now I'm thinking, maybe it means you're the evil man, and I'm the righteous man, and Mr. 9 millimeter here, he's the shepherd protecting my righteous ass in the valley of darkness. Or it could mean you're the righteous man and I'm the shepherd and it's the world that's evil and selfish. I'd like that. But that shit ain't the truth. The truth is, you're the weak, and I'm the tyranny of evil men. But I'm trying, Ringo. I'm trying real hard to be the shepherd.",
    "caption":"-Samuel L. Jackson in 'Pulp Fiction'",
    "img": "app/styles/images/pulpFiction.jpg"},
{"title":"SNL",
    "content":"It is great to be here in New York hosting 'Saturday Night Live'! In case you confused, no, I am not Laurence Fishburne, and I'm Morgan Freeman. I am Samuel L. Jackson, and I'm here to host the very first 'SNL' of 1998! And since this is the very first show of the year, I thought instead of doing the usual monologue, I would just read you a list of my New Year's resolutions! [ takes out card ] Now, I know you might find it shocking that someone as cool and together as myself has New Year's rsolutions.. but.. believe it or not, there are things that even Samuel L. Jackson can improve upon. Forthwith - if I could have a little music, please.. At the top of my list: 'Continue to kick ass' And then I hope to 'Be as bad as I know I can be' Also, to 'Really put it out there, and by it I mean Sammy's mojo' In addition, I plan to 'Give it as good as I get it' 'Be all that and more' and 'Lose my shyness, vis a vis the rocket in my pocket' Plus, I plan to 'Work my voodoo on the lady fans' 'Take a thorn out of some cat's paw.'' and 'Build a shrine to my own bad ass' Then, it's time to 'Give the demons what for' 'Spare the rod and spoil the face' and 'Continue to kick ass' After which, I'll 'Show the bad men what it's all about' 'Release a dove from a ghetto rooftop' and 'Cradle a newborn baby in the ruins of a church' Finally, this year, I will 'Stick it to all the suckas' and I'm gonna 'Show the man that I mean business' ..and I'm gonna 'Take a computer class.'' We have a great show for you tonight! Ben Folds Five is here, so stick around, we'll be right back! ",
    "caption":"-Samuel L. Jackson hosting SNL",
    "img": "app/styles/images/snl.jpg"},
{"title":"Losing Isaiah",
    "content":"Mrs. Lewin, Does Isaiah play with dolls? Sometimes. Any of them black? Yes. And some of them are green, and some of them are purple, and some of them are orange. It doesn't seem to matter to him. He plays with all of them. As you know, Mrs. Lewin, people don't have green or purple or orange faces. When you and Isaiah read together, do any of the books you read have African American characters or pertain to African American history or culture? We read Isaiah all sorts of books in our home. Oh, I'm sure you do, but is there a black face in any of them? For instance, have you read The Planet of Junior Brown, or The People Could Fly, or Many Thousand Gone by Virginia Hamilton? Not yet. Well, how about The Red Dancing Shoes by Denise Patrick or Faith Ringgold's Aunt Harriet's Underground Railroad in the Sky? Not yet. Or maybe your husband has read him Fathers and Sons, or Uncle Jed's Barbershop by Margeree King Mitchell. No, I don't think so. Well, who do you think he identifies with, Mrs. Lewin? The orange-faced muppet? Does he share its muppet history? You ever stop to think how Isaiah must feel living in a world where he never sees anyone like himself? Might be kind of troubling, don't you think? ",
    "caption":"-Samuel L. Jackson in 'Losing Isaiah'",
    "img": "app/styles/images/losingIsaiah.jpg"},
{"title":"The Hateful Eight",
    "content":"Beggin' for his life, your boy told me his whole Life Story. And YOU, was in that story General. And when I knew me I had the son, of the Bloody Nigger Killer of Baton Rouge, I knew me I was gonna have some fun! It was COLD the day I killed your boy. And I don't mean snowy mountain in Wyoming cold... Colder than that. And on that cold day, with your boy at the business end of my gun barrel... I made him STRIP. Right down to his bare ass. Then I told him to start walkin'. I walked his naked ass for two hours... 'fore the cold collapsed him. Then he commits to beggin' again. But this time, he wasn't beggin' to go home. He knew he'd never see his home again. And he wasn't beggin' for his life neither, 'cause he knew that was long gone. All he wanted, was a BLANKET. Now don't judge your boy too harshly, General. You ain't never been cold as your boy was that day. You'd be surprised; what a man that cold, would-do-for-a-blanket. You wanna know what your boy did? I pulled my BIG, BLACK, PECKER outta my pants. And I made him crawl in the snow on all fours over to it. Then I grabbed a handful of that black hair at the back of his head... And I stuck my Big Black Johnson right down his goddamn throat! And it was fulla' blood... so it was warm. Oh, you bet your sweet ass it was warm. And Charles Chester Smithers sucked on that warm black dingus for as loong as he could. Hahahaahaha! Startin' to see pictures, ain't ya?",
    "caption":"-Samuel L Jackson in 'The Hateful Eight",
    "img": "app/styles/images/hateful.jpg"},
{"title":"Django Unchained",
    "content":"Now you were quite the topic of conversation for the last few hours. Seemed like folks never had a bright idea in their life, was comin' up with different ways to kill your ASS. Now most of 'dem ideas involved fuckin wit your fun parts. But while that might SEEM like a good idea. Truth is, once ya snip a niggers nuts, most bleed out. Then I say; 'Hells bells, the niggers we send to LeQuint Dickey, got it worse then that.'' Then they're, 'Let's whip 'em to death,' 'Throw 'em to the mandingos,' 'Feed 'em to Stonesipher's dogs.'' And then I say, 'What's so special 'bout that? We do that shit all the time. Hells bells, the niggers we send to LeQuint Dickey got it worse then that.' So Miss Lara got the bright idea of givin' your ass to The LeQuint Dickey Mining Company. And as a slave of The LeQuint Dickey Mining Company, hence forth, till the day you die, you will be swinging a sledgehammer, all day, every day, turning big rocks into little rocks. And trust me when I tell you it's gonna be 'bout as much fun as it sounds. We sell 'em the mandingos ain't good for nuttin' no more. Like them three y'all came back with. For them big garboons we get twenty a piece. They last 'bout six months. Skinny nigger like you, I give two or three.",
    "caption":"-Samuel L Jackson in 'Django Unchained",
    "img":"app/styles/images/django.jpeg"},
{"title":"The Avengers",
    "content":"These were in Phil Coulson's jacket. Guess he never did get you to sign them. We're dead in the air up here. Our communications, location of the cube, Banner, Thor. I got nothing for you. Lost my one good eye. Maybe I had that coming. Yes, we were going to build an arsenal with the Tesseract. I never put all my chips on that number though, because I was playing something even riskier. There was an idea, Stark knows this, called THE AVENGERS INITIATIVE. The idea was to bring together a group of remarkable people, see if they could become something more. See if they could work together when we needed them to, to fight the battles that we never could. Phil Coulson died still believing in that idea, in heroes. Well, it's an old fashioned notion.",
    "caption":"-Samuel L Jackson in 'Avengers'",
    "img": "app/styles/images/avengers.jpg"}]
